In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel('ip bills.xls Dec_a.xlsx')
df2 = pd.read_excel("ip bills.xls nov_a.xlsx")
df3 = pd.read_excel("ip bills.xls oct_a.xlsx")

In [3]:
df1.head()

,#SlNo,Bill Type,IPOP,Bill No,Bill Date,Bill Amount,Discount,Net Amount,Paid Amount,Balance Amount,Last Pay Mode,User,MRN,AdmID,Category
0,1,Ip Bill,IP,2504,2019-12-01 10:18:47,20050,0,20050,20050,0,CASH,brundha s-csh,142857,2494,NaN
1,2,Ip Bill,IP,2505,2019-12-01 10:33:09,5235,0,5235,5235,0,CASH,brundha s-csh,468092,2501,NaN
2,3,Ip Bill,IP,2506,2019-12-01 12:32:29,1995,0,1995,1995,0,CARD,brundha s-csh,170560,2498,NaN
3,4,Ip Bill,IP,2507,2019-12-01 13:42:51,13085,0,13085,13085,0,CARD,brundha s-csh,474228,2482,NaN
4,5,Ip Bill,IP,2508,2019-12-01 14:26:24,14120,0,14120,14120,0,TPA,brundha s-csh,473777,2486,NaN

In [4]:
df1.shape

(12534, 15)

In [5]:
df2.head()

,#SlNo,Bill Type,IPOP,Bill No,Bill Date,Bill Amount,Discount,Net Amount,Paid Amount,Balance Amount,Last Pay Mode,User,MRN,AdmID,Category
0,1,Ip Bill,IP,2250,2019-11-01 10:10:46,111040,7960,103080,103080,0,TPA,thriveni-csh,472980,2197,NaN
1,2,Ip Bill,IP,2251,2019-11-01 11:50:09,31205,0,31205,31205,0,PREPAID,thriveni-csh,235465,2233,NaN
2,3,Ip Bill,IP,2252,2019-11-01 12:41:04,7045,0,7045,7045,0,PREPAID,thriveni-csh,473501,2232,NaN
3,4,Ip Bill,IP,2253,2019-11-02 12:46:08,27680,0,27680,27680,0,TPA,thriveni-csh,309436,2238,NaN
4,5,Ip Bill,IP,2254,2019-11-02 15:36:26,56795,0,56795,56795,0,CARD,vidya d p-csh,473640,2219,NaN

In [6]:
df2.shape

(11021, 15)

In [7]:
df3.head()

,#SlNo,Bill Type,IPOP,Bill No,Bill Date,Bill Amount,Discount,Net Amount,Paid Amount,Balance Amount,Last Pay Mode,User,MRN,AdmID,Category
0,1,Ip Bill,IP,2065,2019-10-11 12:42:18,170255,20000,150255,150255,0,CASH,thriveni-csh,473241,2056,NaN
1,2,Ip Bill,IP,2066,2019-10-11 13:12:55,23805,0,23805,23805,0,TPA,thriveni-csh,472750,2069,NaN
2,3,Ip Bill,IP,2067,2019-10-11 13:18:50,24835,0,24835,24835,0,TPA,thriveni-csh,194381,2050,NaN
3,4,Ip Bill,IP,2068,2019-10-11 13:33:59,25145,1439,23706,23706,0,TPA,thriveni-csh,425772,2045,NaN
4,5,Ip Bill,IP,2069,2019-10-11 15:02:19,102350,0,102350,102350,0,PREPAID,thriveni-csh,473242,2057,NaN

In [8]:
data_frames=[df3,df2,df1]
df_main = pd.concat(data_frames, axis = 0)

In [9]:
df_main.shape

(31185, 15)

In [10]:
df_main.info()

<class 'pandas.core.frame.DataFrame'>
Index: 31185 entries, 0 to 12533
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   #SlNo           31185 non-null  int64
 1   Bill Type       31185 non-null  object
 2   IPOP            31185 non-null  object
 3   Bill No         31185 non-null  int64
 4   Bill Date       31185 non-null  datetime64[ns]
 5   Bill Amount     31185 non-null  int64
 6   Discount        31185 non-null  int64
 7   Net Amount      31185 non-null  int64
 8   Paid Amount     31185 non-null  int64
 9   Balance Amount  31185 non-null  int64
 10  Last Pay Mode   29073 non-null  object
 11  User            31182 non-null  object
 12  MRN             31185 non-null  int64
 13  AdmID           31185 non-null  int64
 14  Category        2719 non-null   object
dtypes: datetime64[ns](1), int64(9), object(5)
memory usage: 3.8+ MB

In [11]:
df_main.isnull().sum()

#SlNo                 0
Bill Type             0
IPOP                  0
Bill No               0
Bill Date             0
Bill Amount           0
Discount              0
Net Amount            0
Paid Amount           0
Balance Amount        0
Last Pay Mode      2112
User                  3
MRN                   0
AdmID                 0
Category          28466
dtype: int64

In [12]:
df_main.columns

Index(['#SlNo', 'Bill Type', 'IPOP', 'Bill No', 'Bill Date', 'Bill Amount',
       'Discount', 'Net Amount', 'Paid Amount', 'Balance Amount',
       'Last Pay Mode', 'User', 'MRN', 'AdmID', 'Category'],
      dtype='object')

In [13]:
df = df_main.copy()

In [14]:
df['Last Pay Mode'] = df['Last Pay Mode'].fillna(df['Last Pay Mode'].mode()[0])
df['User'] = df['User'].fillna(df['User'].mode()[0])

In [15]:
df = df.drop(columns = 'Category')

In [16]:
df['Bill Date'] = pd.to_datetime(df['Bill Date'])

In [17]:
df.isnull().sum()

#SlNo             0
Bill Type         0
IPOP              0
Bill No           0
Bill Date         0
Bill Amount       0
Discount          0
Net Amount        0
Paid Amount       0
Balance Amount    0
Last Pay Mode     0
User              0
MRN               0
AdmID             0
dtype: int64

In [18]:
df['User'].value_counts()

User
rangaswamy-pha               3397
padmavathi s k-pha           2410
harinath chowdari.n-pha      2307
deepika t-opd                1961
bharathi h-opd               1959
shalet d souza-opd           1884
shobha b.r-lab               1871
pushpa sudha-opd             1620
geetha b-lab                 1297
vidya c.n-opd                1227
shobha c-opd                 1115
madhuri r-pha                1051
hema m g-lab                  947
anitha p-rad                  886
second flr 1st-nur            701
harshitha p-pha               695
six flr icu-nur               635
brundha s-csh                 521
mahesh babu-csh               491
thriveni-csh                  489
veena s-rad                   378
arathi m m-mrd                266
vivekananda swamiji s-pha     252
veekshitha v-mrd              244
kusuma-mrd                    240
manjula t s-mrd               228
priyanka-mrd                  227
sunitha-lab                   211
third flr 2nd wind-nur        185
fourth floor 1st-nur          182
casuality-cas                 178
first flr 1st-nur             121
kalavathi-lab                 117
bharathi n-sec                114
ot-ott                        108
geetha h r-nur                 86
vidya d p-csh                  75
midhun v-lab                   73
manuja-lab                     63
john samuel-mrd                55
puneeth k-mrd                  51
renuka n.b-mrd                 51
sampath k n-pha                41
cathlab-nur                    33
anitha v-csh                   31
first flr 2nd wing-nur         31
asha-str                       24
mamatha-lab                    22
nephrology-nur                 11
pushpalatha r-mrd               8
sudhir-itd                      6
sushma-opd                      3
achamma-lab                     3
venkat-adm                      2
dr.snusheen-qlt                 1
Name: count, dtype: int64

In [19]:
user_names = {}
c = 0

anonymized_users_names = []
for i in df['User']:
    if i not in user_names:
        c += 1
        user_names[i] = f"BV_{c:03d}"
    anonymized_users_names.append(user_names[i])
    
user_list = pd.Series(anonymized_users_names)
user_list.value_counts()

BV_013    3397
BV_015    2410
BV_016    2307
BV_021    1961
BV_012    1959
BV_036    1884
BV_008    1871
BV_028    1620
BV_006    1297
BV_020    1227
BV_032    1115
BV_014    1051
BV_007     947
BV_037     886
BV_047     701
BV_019     695
BV_046     635
BV_002     521
BV_003     491
BV_001     489
BV_023     378
BV_024     266
BV_027     252
BV_017     244
BV_031     240
BV_029     228
BV_045     227
BV_009     211
BV_043     185
BV_049     182
BV_042     178
BV_044     121
BV_010     117
BV_035     114
BV_051     108
BV_025      86
BV_004      75
BV_005      73
BV_040      63
BV_018      55
BV_055      51
BV_034      51
BV_026      41
BV_054      33
BV_022      31
BV_048      31
BV_030      24
BV_011      22
BV_052      11
BV_038       8
BV_039       6
BV_033       3
BV_050       3
BV_041       2
BV_053       1
Name: count, dtype: int64

In [20]:
df["User_Anonymized"] = anonymized_users_names

In [21]:
df.head(1)

,#SlNo,Bill Type,IPOP,Bill No,Bill Date,Bill Amount,Discount,Net Amount,Paid Amount,Balance Amount,Last Pay Mode,User,MRN,AdmID,User_Anonymized
0,1,Ip Bill,IP,2065,2019-10-11 12:42:18,170255,20000,150255,150255,0,CASH,thriveni-csh,473241,2056,BV_001

In [22]:
Anonymized_df = pd.DataFrame(list(user_names.items()), columns=["User", "BloomValue Code"])

In [23]:
Anonymized_df.head()

              User BloomValue Code
0     thriveni-csh          BV_001
1    brundha s-csh          BV_002
2  mahesh babu-csh          BV_003
3    vidya d p-csh          BV_004
4     midhun v-lab          BV_005

In [24]:
df = df.drop(columns = 'User')

In [25]:
df.head(1)

,#SlNo,Bill Type,IPOP,Bill No,Bill Date,Bill Amount,Discount,Net Amount,Paid Amount,Balance Amount,Last Pay Mode,MRN,AdmID,User_Anonymized
0,1,Ip Bill,IP,2065,2019-10-11 12:42:18,170255,20000,150255,150255,0,CASH,473241,2056,BV_001

In [26]:
df.rename(columns={'#SlNo': 'S.No.'}, inplace=True)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 31185 entries, 0 to 12533
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   S.No.            31185 non-null  int64
 1   Bill Type        31185 non-null  object
 2   IPOP             31185 non-null  object
 3   Bill No          31185 non-null  int64
 4   Bill Date        31185 non-null  datetime64[ns]
 5   Bill Amount      31185 non-null  int64
 6   Discount         31185 non-null  int64
 7   Net Amount       31185 non-null  int64
 8   Paid Amount      31185 non-null  int64
 9   Balance Amount   31185 non-null  int64
 10  Last Pay Mode    31185 non-null  object
 11  MRN              31185 non-null  int64
 12  AdmID            31185 non-null  int64
 13  User_Anonymized  31185 non-null  object
dtypes: datetime64[ns](1), int64(9), object(4)
memory usage: 3.6+ MB

In [31]:
df.to_csv("bv_details.csv", index=False)